app/views/genres/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."genre_id" = ?  [["genre_id", 1]]
---
  <h2>Books in the genre of <%= @genre.name %></h2>
  <% @genre.books.each do |book| %>