app/views/authors/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 1]]
---
  <h2>Books by: <%= @author.name %></h2>
  <% @author.books.each do |book| %>