app/views/books/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= f.label "Author: " %><br>
    <%= f.collection_select :author_id, Author.all, :id, :name, {prompt: "Please select an author"} %>

SELECT "genres".* FROM "genres"
---
    <%= f.label "Genre: " %><br>
    <%= f.collection_select :genre_id, Genre.all, :id, :name, {prompt: "Please select a genre"} %>