app/views/books/index.html.erb

          <td>
            <%= book.check_out_logs.last.due_date %>
---
SELECT  "check_out_logs".* FROM "check_out_logs" WHERE "check_out_logs"."book_id" = ? ORDER BY "check_out_logs"."id" DESC LIMIT ?  [["book_id", 1], ["LIMIT", 1]]

          <% if @user %>
            <%= book.check_out_logs.last.overdue? ? 'yes' : 'no' %>
---
SELECT  "check_out_logs".* FROM "check_out_logs" WHERE "check_out_logs"."book_id" = ? ORDER BY "check_out_logs"."id" DESC LIMIT ?  [["book_id", 1], ["LIMIT", 1]]