app/views/books/overdue.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    <% @books.each do |book| %>
      <% user = User.find(book.present_user_id) %>

SELECT  "check_out_logs".* FROM "check_out_logs" WHERE "check_out_logs"."book_id" = ? ORDER BY "check_out_logs"."id" DESC LIMIT ?  [["book_id", 1], ["LIMIT", 1]]
---
        <td>
          <%= book.check_out_logs.last.due_date %>