app/views/books/show.html.erb

<% elsif (@book.checked_out && (@user.id == @book.present_user_id)) %>
  <%= button_to "Check In", book_check_in_path(@book.id, @book.check_out_logs.last), class: "btn btn-primary", method: :post %>
---
SELECT  "check_out_logs".* FROM "check_out_logs" WHERE "check_out_logs"."book_id" = ? ORDER BY "check_out_logs"."id" DESC LIMIT ?  [["book_id", 1], ["LIMIT", 1]]