app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors"
---
  def index
    @authors = Author.all

INSERT INTO "authors" ("name", "deceased", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Unknown"], ["deceased", 0], ["created_at", "2020-07-16 09:13:43.437051"], ["updated_at", "2020-07-16 09:13:43.437051"]]
---
  def create
    @author = Author.new(author_params)
    if @author.save

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = current_user
    @author = Author.find(params[:id])