app/controllers/books_controller.rb

  def index
    @user = nil
    #@books = []
    if params.include? :user_id
      @user = User.find(params[:user_id])
      redirect_to root_path if @user != current_user
      @books = Book.checked_out(@user.id)
    else
      @books = Book.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "author_id", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Harry Potter"], ["author_id", 1], ["genre_id", 1], ["created_at", "2020-07-16 09:13:55.009125"], ["updated_at", "2020-07-16 09:13:55.009125"]]

  def edit
    @book = Book.find(params[:id]) # move to a before action
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def overdue
    @books = []
    Book.all.each do |book|
      if book.check_out_logs.last
---
SELECT "books".* FROM "books"
SELECT  "check_out_logs".* FROM "check_out_logs" WHERE "check_out_logs"."book_id" = ? ORDER BY "check_out_logs"."id" DESC LIMIT ?  [["book_id", 1], ["LIMIT", 1]]