app/controllers/check_out_logs_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @book = Book.find(params[:book_id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "check_out_logs" ("comment", "user_id", "book_id", "created_at", "updated_at", "check_out_date") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "nice book"], ["user_id", 3], ["book_id", 1], ["created_at", "2020-07-19 19:06:34.686449"], ["updated_at", "2020-07-19 19:06:34.686449"], ["check_out_date", "2020-07-19"]]
UPDATE "books" SET "checked_out" = ?, "present_user_id" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["checked_out", 1], ["present_user_id", 3], ["updated_at", "2020-07-19 19:06:34.924903"], ["id", 1]]
---
  def create
    book = Book.find(params[:check_out_log][:book_id])
    if book.checked_out
      flash[:notice] = "This book has already been checked out."
      render book_path(book)
    else
      CheckOutLog.create(check_out_log_params)
      book.checked_out = true
      book.present_user_id = params[:check_out_log][:user_id]
      book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "check_out_logs".* FROM "check_out_logs" WHERE "check_out_logs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "check_out_logs" SET "check_in_date" = ?, "updated_at" = ? WHERE "check_out_logs"."id" = ?  [["check_in_date", "2020-07-19"], ["updated_at", "2020-07-19 19:06:41.551351"], ["id", 1]]
UPDATE "books" SET "checked_out" = ?, "present_user_id" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["checked_out", 0], ["present_user_id", nil], ["updated_at", "2020-07-19 19:06:41.681489"], ["id", 1]]
---
  def check_in
    user = current_user
    book = Book.find(params[:book_id])
    if !book.checked_out
      flash[:notice] = "This book is not checked out."
      render book_path(book)
    elsif (book.checked_out && (book.present_user_id == user.id))
      check_in = CheckOutLog.find(params[:id])
      check_in.check_in_date = Date.today
      book.checked_out = false
      book.present_user_id = nil
      check_in.save
      book.save