app/controllers/genres_controller.rb

  def index
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @genre = Genre.new(genre_params)
    if @genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "coding"], ["created_at", "2020-07-16 09:13:35.531873"], ["updated_at", "2020-07-16 09:13:35.531873"]]

  def show
    @user = current_user
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]