app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sdbctanonymous@gmail.com"], ["LIMIT", 1]]
---
  def create
    if auth
      # Logged in via oauth
      user = User.find_or_create_by_omniauth(auth)
      session[:user_id] = user.id
      redirect_to root_path
    else
      # Normal login flow
      @user = User.find_by(email: params[:user][:email])