app/views/layouts/application.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <% else%>
          <% user = User.find(session[:user_id]) %>